In [104]:
import pandas as pd
import numpy as np

## IMPORTING DATA

In [2]:
houses=pd.read_csv(r'C:\Users\user\Downloads\USA_Housing.csv')

In [3]:
houses

,Avg. Area Income,Avg. Area House Age,Avg. Area Number of Rooms,Avg. Area Number of Bedrooms,Area Population,Price,Address
0,79545.458574,5.682861,7.009188,4.09,23086.800503,1.059034e+06,"208 Michael Ferry Apt. 674\nLaurabury, NE 3701..."
1,79248.642455,6.002900,6.730821,3.09,40173.072174,1.505891e+06,"188 Johnson Views Suite 079\nLake Kathleen, CA..."
2,61287.067179,5.865890,8.512727,5.13,36882.159400,1.058988e+06,"9127 Elizabeth Stravenue\nDanieltown, WI 06482..."
3,63345.240046,7.188236,5.586729,3.26,34310.242831,1.260617e+06,USS Barnett\nFPO AP 44820
4,59982.197226,5.040555,7.839388,4.23,26354.109472,6.309435e+05,USNS Raymond\nFPO AE 09386
...,...,...,...,...,...,...,...
4995,60567.944140,7.830362,6.137356,3.46,22837.361035,1.060194e+06,USNS Williams\nFPO AP 30153-7653
4996,78491.275435,6.999135,6.576763,4.02,25616.115489,1.482618e+06,"PSC 9258, Box 8489\nAPO AA 42991-3352"
4997,63390.686886,7.250591,4.805081,2.13,33266.145490,1.030730e+06,"4215 Tracy Garden Suite 076\nJoshualand, VA 01..."
4998,68001.331235,5.534388,7.130144,5.44,42625.620156,1.198657e+06,USS Wallace\nFPO AE 73316
4999,65510.581804,5.992305,6.792336,4.07,46501.283803,1.298950e+06,"37778 George Ridges Apt. 509\nEast Holly, NV 2..."

In [6]:
houses.columns

Index(['Avg. Area Income', 'Avg. Area House Age', 'Avg. Area Number of Rooms',
       'Avg. Area Number of Bedrooms', 'Area Population', 'Price', 'Address'],
      dtype='object')

In [10]:
houses.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5000 entries, 0 to 4999
Data columns (total 7 columns):
 #   Column                        Non-Null Count  Dtype
---  ------                        --------------  -----
 0   Avg. Area Income              5000 non-null   float64
 1   Avg. Area House Age           5000 non-null   float64
 2   Avg. Area Number of Rooms     5000 non-null   float64
 3   Avg. Area Number of Bedrooms  5000 non-null   float64
 4   Area Population               5000 non-null   float64
 5   Price                         5000 non-null   float64
 6   Address                       5000 non-null   object
dtypes: float64(6), object(1)
memory usage: 273.6+ KB

In [17]:
houses.isnull().sum()

Avg. Area Income                0
Avg. Area House Age             0
Avg. Area Number of Rooms       0
Avg. Area Number of Bedrooms    0
Area Population                 0
Price                           0
Address                         0
dtype: int64

In [18]:
houses.describe(include='all')

,Avg. Area Income,Avg. Area House Age,Avg. Area Number of Rooms,Avg. Area Number of Bedrooms,Area Population,Price,Address
count,5000.000000,5000.000000,5000.000000,5000.000000,5000.000000,5.000000e+03,5000
unique,NaN,NaN,NaN,NaN,NaN,NaN,5000
top,NaN,NaN,NaN,NaN,NaN,NaN,"208 Michael Ferry Apt. 674\nLaurabury, NE 3701..."
freq,NaN,NaN,NaN,NaN,NaN,NaN,1
mean,68583.108984,5.977222,6.987792,3.981330,36163.516039,1.232073e+06,NaN
std,10657.991214,0.991456,1.005833,1.234137,9925.650114,3.531176e+05,NaN
min,17796.631190,2.644304,3.236194,2.000000,172.610686,1.593866e+04,NaN
25%,61480.562388,5.322283,6.299250,3.140000,29403.928702,9.975771e+05,NaN
50%,68804.286404,5.970429,7.002902,4.050000,36199.406689,1.232669e+06,NaN
75%,75783.338666,6.650808,7.665871,4.490000,42861.290769,1.471210e+06,NaN
max,107701.748378,9.519088,10.759588,6.500000,69621.713378,2.469066e+06,NaN

In [23]:
houses["Address"].value_counts()

208 Michael Ferry Apt. 674\nLaurabury, NE 37010-5101             1
314 Christopher Square Apt. 404\nLake Ronaldville, SD 42025      1
21042 Wilson Islands Suite 238\nFischerchester, MP 42425-4129    1
Unit 8831 Box 5748\nDPO AE 73012-7314                            1
481 Kaitlin Mission Apt. 309\nJodystad, IA 16947                 1
                                                                ..
054 Carter Crescent Suite 674\nGlennport, WA 11140               1
8460 Kathleen Mission Apt. 482\nPort Amytown, KY 72016           1
3737 Hartman Rue\nReneestad, ID 69250-7718                       1
3465 Latoya Well\nNelsonmouth, MI 55741-4287                     1
37778 George Ridges Apt. 509\nEast Holly, NV 29290-3595          1
Name: Address, Length: 5000, dtype: int64

In [24]:
houses.Address.unique()

array(['208 Michael Ferry Apt. 674\nLaurabury, NE 37010-5101',
       '188 Johnson Views Suite 079\nLake Kathleen, CA 48958',
       '9127 Elizabeth Stravenue\nDanieltown, WI 06482-3489', ...,
       '4215 Tracy Garden Suite 076\nJoshualand, VA 01707-9165',
       'USS Wallace\nFPO AE 73316',
       '37778 George Ridges Apt. 509\nEast Holly, NV 29290-3595'],
      dtype=object)

## PRICE PREDICTION

###### "------------------- LINEAR REGRESSION -------------------"

In [30]:
from sklearn.linear_model import LinearRegression
from sklearn.model_selection import train_test_split

In [31]:
houses.head()

,Avg. Area Income,Avg. Area House Age,Avg. Area Number of Rooms,Avg. Area Number of Bedrooms,Area Population,Price,Address
0,79545.458574,5.682861,7.009188,4.09,23086.800503,1.059034e+06,"208 Michael Ferry Apt. 674\nLaurabury, NE 3701..."
1,79248.642455,6.002900,6.730821,3.09,40173.072174,1.505891e+06,"188 Johnson Views Suite 079\nLake Kathleen, CA..."
2,61287.067179,5.865890,8.512727,5.13,36882.159400,1.058988e+06,"9127 Elizabeth Stravenue\nDanieltown, WI 06482..."
3,63345.240046,7.188236,5.586729,3.26,34310.242831,1.260617e+06,USS Barnett\nFPO AP 44820
4,59982.197226,5.040555,7.839388,4.23,26354.109472,6.309435e+05,USNS Raymond\nFPO AE 09386

In [41]:
X=pd.read_csv(r'C:\Users\user\Downloads\USA_Housing.csv')

In [42]:
X=X.drop("Address",axis=1)

In [43]:
X.head()

,Avg. Area Income,Avg. Area House Age,Avg. Area Number of Rooms,Avg. Area Number of Bedrooms,Area Population,Price
0,79545.458574,5.682861,7.009188,4.09,23086.800503,1.059034e+06
1,79248.642455,6.002900,6.730821,3.09,40173.072174,1.505891e+06
2,61287.067179,5.865890,8.512727,5.13,36882.159400,1.058988e+06
3,63345.240046,7.188236,5.586729,3.26,34310.242831,1.260617e+06
4,59982.197226,5.040555,7.839388,4.23,26354.109472,6.309435e+05

In [45]:
X=X.drop("Price",axis=1)

In [46]:
X.head()

,Avg. Area Income,Avg. Area House Age,Avg. Area Number of Rooms,Avg. Area Number of Bedrooms,Area Population
0,79545.458574,5.682861,7.009188,4.09,23086.800503
1,79248.642455,6.002900,6.730821,3.09,40173.072174
2,61287.067179,5.865890,8.512727,5.13,36882.159400
3,63345.240046,7.188236,5.586729,3.26,34310.242831
4,59982.197226,5.040555,7.839388,4.23,26354.109472

In [47]:
y=houses[["Price"]]

In [49]:
y.head()

          Price
0  1.059034e+06
1  1.505891e+06
2  1.058988e+06
3  1.260617e+06
4  6.309435e+05

#### "Splitting the dataset into training and testing set"

In [122]:
X_train,X_test,y_train,y_test=train_test_split(X,y,test_size=0.2) #20% of observations are for test and 80% are for training

In [123]:
X_train

,Avg. Area Income,Avg. Area House Age,Avg. Area Number of Rooms,Avg. Area Number of Bedrooms,Area Population
617,62699.439217,6.358747,7.460135,4.28,37816.337696
1916,63288.040574,4.762273,7.083527,6.23,39626.516082
3515,55516.657166,5.379114,5.732593,4.34,40537.096482
3160,65803.600647,6.730870,7.063988,4.06,36011.051169
3260,72391.490189,6.039066,5.750672,4.45,32674.669155
...,...,...,...,...,...
1255,49493.296084,6.312558,7.586943,3.29,39909.175304
873,54617.886149,6.234744,6.782861,2.18,29613.844003
1103,51995.582857,6.766778,6.746501,2.30,47073.797918
183,48531.364229,6.863184,8.517401,5.30,39731.150563
1827,65423.246922,5.756826,6.353157,3.13,28914.791456

In [124]:
X_test

,Avg. Area Income,Avg. Area House Age,Avg. Area Number of Rooms,Avg. Area Number of Bedrooms,Area Population
3226,70975.971096,6.791320,8.999013,3.15,61104.362782
4849,69285.681435,4.498635,6.462665,2.49,42643.909361
1067,41533.012960,6.853578,5.055629,4.24,31685.402692
821,79843.146328,5.775992,7.304338,3.24,42452.941192
343,76245.218475,7.955767,7.826125,3.12,32016.234756
...,...,...,...,...,...
2302,65969.707036,7.325976,8.020966,4.09,61772.756810
2877,70562.358506,7.037252,5.012793,3.48,26073.222303
1095,59295.680113,4.730912,8.091166,4.44,46784.538593
1699,62902.255492,6.577966,6.711163,3.40,27321.032931
1765,58655.854097,5.857894,6.630832,4.02,40740.780151

In [125]:
linearmodel=LinearRegression()

In [126]:
linearmodel.fit(X_train,y_train) # training is taking place

LinearRegression()

In [167]:
test_pred=linearmodel.predict(X_test)
train_pred=linearmodel.predict(X_train)

In [168]:
pd.DataFrame(test_pred,columns=["Predictions"]).head()

    Predictions
0  2.036352e+06
1  1.036017e+06
2  4.914636e+05
3  1.575134e+06
4  1.762146e+06

In [171]:
y_test.head()

             Price
3226  2.100698e+06
4849  1.017105e+06
1067  6.822003e+05
821   1.424787e+06
343   1.689120e+06

In [135]:
from sklearn.metrics import r2_score,mean_absolute_error,mean_squared_error

###### " Test prediction evaluation"

In [178]:
r_squared=r2_score(test_pred,y_test)
print("R2 Score:", r_squared)

R2 Score: 0.9180842934417074

In [175]:
mae=mean_absolute_error(y_test,test_pred)
print("Mean Absolute Error (MAE):", mae)

Mean Absolute Error (MAE): 80297.58252548403

In [176]:
mse=mean_squared_error(y_test,test_pred)
print("Mean Squared Error (MSE):", mse)

Mean Squared Error (MSE): 9954693444.650734

In [147]:
rmse=np.sqrt(mse)
print("Root Mean Squared Error (RMSE):", rmse)

Root Mean Squared Error (RMSE): 99773.21005485758

###### "Train prediction evaluation"

In [180]:
r_squared=r2_score(train_pred,y_train)
print("R2 Score:", r_squared)

R2 Score: 0.9083419582356576

In [181]:
mae=mean_absolute_error(y_train,train_pred)
print("Mean Absolute Error (MAE):", mae)

Mean Absolute Error (MAE): 81638.54951084314

In [182]:
mse=mean_squared_error(y_train,train_pred)
print("Mean Squared Error (MSE):", mse)

Mean Squared Error (MSE): 10290985357.637423

In [183]:
rmse=np.sqrt(mse)
print("Root Mean Squared Error (RMSE):", rmse)

Root Mean Squared Error (RMSE): 101444.49397398275

In [261]:
coef=linearmodel.coef_
coef

array([[2.16336097e+01, 1.64758939e+05, 1.20966090e+05, 1.76999205e+03,
        1.50617884e+01]])

In [262]:
intercept=linearmodel.intercept_
intercept

array([-2632536.94230484])

In [263]:
(np.dot(X_test,coef.transpose())+intercept).shape

(1000, 1)